Repository: 000hen/JustHostMC
Catalog: app/JustHostMC.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_tw

# AppDescription
source: JustHostMC — Minecraft Server Manager
zh_tw: JustHostMC — Minecraft 伺服器管理工具

# MainTitle.Text
source: JustHostMC — Minecraft Server Manager
zh_tw: JustHostMC - Minecraft 伺服器管理工具

# RefreshButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Refresh
zh_tw: 重新整理

# CreateServerButtonLabel.Text
source: Create server
zh_tw: 建立伺服器

# NoServersHint.Text
source: No servers yet. Select “Create server” to add one.
zh_tw: 還沒有伺服器。選取「建立伺服器」來新增一個。

# AdaptiveFilterLayoutFilterButtonLabel.Text
source: Filters
zh_tw: 篩選

# OnMachineNotice.Title
source: Servers run on this PC
zh_tw: 伺服器會在這台電腦上執行

# OnMachineNotice.Message
source: Without Docker, servers run directly on your computer (not in a container). A per-server memory limit still applies.
zh_tw: 未使用 Docker 時，伺服器會直接在你的電腦上執行（不在容器中）。每個伺服器的記憶體限制仍會套用。

# ServerStartButton.Content
source: Start
zh_tw: 啟動

# ServerStopButton.Content
source: Stop
zh_tw: 停止

# ServerDeleteButton.Content
source: Delete
zh_tw: 刪除

# ServerStatus_Running
source: Running
zh_tw: 執行中

# ServerStatus_Stopped
source: Stopped
zh_tw: 已停止

# ServerStatus_Installing
source: Installing
zh_tw: 安裝中

# ServerStatus_Starting
source: Starting
zh_tw: 啟動中

# ServerStatus_Stopping
source: Stopping
zh_tw: 停止中

# ServerStatus_Crashed
source: Crashed
zh_tw: 已當機

# ServerStatus_Unknown
source: Unknown
zh_tw: 不明

# ServerNav_StateChangedAutomationName
source: {name}, state changed to {status}
zh_tw: {name}，狀態已變更為{status}

# ServerConsoleButton.Content
source: Console
zh_tw: 控制台

# ConsoleDialog.Title
source: Console
zh_tw: 控制台

# ConsoleDialog.CloseButtonText
source: Close
zh_tw: 關閉

# ConsoleInput.PlaceholderText
source: Type a command and press Enter
zh_tw: 輸入指令後按 Enter

# ConsoleSendButton.Content
source: Send
zh_tw: 送出

# ConsoleOutputHeader.Text
source: Console output
zh_tw: 控制台輸出

# ConsoleSendButtonLabel.Text
source: Send
zh_tw: 送出

source: Send command
zh_tw: 送出指令

# CreateServerName.Header
source: Name
zh_tw: 名稱

# CreateServerName.PlaceholderText
source: My server
zh_tw: 我的伺服器

# CreateServer_DefaultName
source: My Server
zh_tw: 我的伺服器

# CreateServerType.Header
source: Type
zh_tw: 類型

# ServerTypeVanillaItem.Content
source: Vanilla
zh_tw: 原版

# CreateServerVersionHint.Text
source: Versions are fetched from the internet.
zh_tw: 版本會從網路取得。

# CreateServerVersion.Header
source: Version
zh_tw: 版本

# CreateServerVersionError.Title
source: Could not load versions
zh_tw: 無法載入版本

# CreateServerVersionError.Message
source: Check your internet connection and try selecting the server type again.
zh_tw: 請檢查網路連線，然後重新選取伺服器類型。

# CreateServerAdvancedHeader.Text
source: Advanced settings
zh_tw: 進階設定

# CreateServerMemory.Header
source: Memory (MB)
zh_tw: 記憶體 (MB)

# CreateServerMemoryHint.Text
source: Maximum heap memory for the Java process. 2048 MB is recommended for most servers.
zh_tw: Java 行程的最大堆積記憶體。多數伺服器建議使用 2048 MB。

# CreateServerPort.Header
source: Port
zh_tw: 連接埠

# CreateServerPortHint.Text
source: Leave at 0 to auto-assign a free port. Use 25565 for the Minecraft default.
zh_tw: 保留為 0 可自動指派可用連接埠。Minecraft 預設值為 25565。

# InstallProgressHeader.Text
source: Creating server
zh_tw: 建立伺服器中

# InstallDismissButton.Content
source: Dismiss
zh_tw: 關閉

# install.progress.preparing
source: Preparing
zh_tw: 準備中

# install.progress.resolving_version
source: Resolving version
zh_tw: 解析版本中

# install.progress.downloading_server
source: Downloading server
zh_tw: 下載伺服器中

# install.progress.downloading_jre
source: Downloading Java runtime
zh_tw: 下載 Java 執行階段中

# install.progress.extracting_jre
source: Extracting Java runtime
zh_tw: 解壓縮 Java 執行階段中

# install.progress.downloading_installer
source: Downloading installer
zh_tw: 下載安裝程式中

# install.progress.running_installer
source: Running installer
zh_tw: 執行安裝程式中

# shop.install.downloading
source: Downloading pack files
zh_tw: 下載整合包檔案中

# install.progress.done
source: Done.
zh_tw: 完成。

# error_version_not_found
source: That version could not be found.
zh_tw: 找不到該版本。

# error_jre_download_failed
source: Could not download the required Java runtime.
zh_tw: 無法下載所需的 Java 執行階段。

# error_type_unsupported
source: This server type isn? supported yet.
zh_tw: 此伺服器類型尚未支援。

# error_install_failed
source: Installation failed. See the log for details.
zh_tw: 安裝失敗。請查看記錄以了解詳細資訊。

# error_backup_failed
source: The backup operation failed. See the log for details.
zh_tw: 備份作業失敗。請查看記錄以了解詳細資訊。

# error_backup_not_found
source: That backup could not be found.
zh_tw: 找不到該備份。

# error.server_running
source: Stop the server before restoring a backup.
zh_tw: 還原備份前，請先停止伺服器。

# ServerBackupsButton.Content
source: Backups
zh_tw: 備份

# BackupCreateButton.Content
source: Create backup
zh_tw: 建立備份

# BackupSafeOnline.Content
source: Safe online (pause saves)
zh_tw: 線上安全備份（暫停儲存）

# BackupsEmptyHint.Text
source: No backups yet. Select Create backup to make one.
zh_tw: 還沒有備份。選取「建立備份」來建立一份。

# BackupRestoreButton.Content
source: Restore
zh_tw: 還原

# BackupRestoreConfirmText.Text
source: Restore this backup? It replaces the server's current world and files. The server must be stopped.
zh_tw: 要還原這份備份嗎？這會取代伺服器目前的世界與檔案。伺服器必須先停止。

# BackupRestoreConfirmButton.Content
source: Restore
zh_tw: 還原

# BackupDeleteButton.Content
source: Delete
zh_tw: 刪除

# BackupDeleteConfirmText.Text
source: Delete this backup permanently?
zh_tw: 要永久刪除這份備份嗎？

# BackupDeleteConfirmButton.Content
source: Delete
zh_tw: 刪除

# SettingsButton.Content
source: Settings
zh_tw: 設定

# SettingsDialog.Title
source: Settings
zh_tw: 設定

# SettingsDialog.CloseButtonText
source: Close
zh_tw: 關閉

# SettingsCategoryEngine.Text
source: Engine & Servers
zh_tw: 引擎與伺服器

# SettingsCategoryApp.Text
source: Application
zh_tw: 應用程式

# SettingsRetentionHeader.Text
source: Log retention
zh_tw: 記錄保留

# SettingsRetentionHint.Text
source: Install and console logs are pruned automatically. Use 0 for no limit.
zh_tw: 安裝與控制台記錄會自動清理。使用 0 表示不限制。

# SettingsKeepDays.Header
source: Keep logs for (days)
zh_tw: 記錄保留天數

# SettingsMaxSize.Header
source: Total size cap (MB)
zh_tw: 總大小上限 (MB)

# SettingsSaveButton.Content
source: Save
zh_tw: 儲存

# SettingsPurgeButton.Content
source: Purge now
zh_tw: 立即清理

# SettingsEngineMonitorHeader.Text
source: Engine diagnostics
zh_tw: 引擎診斷

# SettingsEngineMonitorHint.Text
source: Inspect the engine process's live standard output, error output, and input-watchdog lifecycle.
zh_tw: 檢視引擎行程的即時標準輸出、錯誤輸出與輸入監看生命週期。

# SettingsEngineMonitorButton.Content
source: Open engine monitor
zh_tw: 開啟引擎監視器

# Settings_PurgeResult
source: Purged {count} file(s), freed {size}.
zh_tw: 已清理 {count} 個檔案，釋放 {size}。

# SettingsDataHeader.Text
source: Remove all data
zh_tw: 移除所有資料

# SettingsDataHint.Text
source: Stops all servers and permanently deletes every server, backup, log, and the downloaded Java runtime. This cannot be undone.
zh_tw: 停止所有伺服器，並永久刪除所有伺服器、備份、記錄，以及已下載的 Java 執行階段。此動作無法復原。

# SettingsRemoveDataButton.Content
source: Remove all data
zh_tw: 移除所有資料

# SettingsRemoveDataConfirmText.Text
source: Delete all servers, backups, logs, and the Java runtime? This cannot be undone.
zh_tw: 要刪除所有伺服器、備份、記錄和 Java 執行階段嗎？此動作無法復原。

# SettingsRemoveDataConfirmButton.Content
source: Remove everything
zh_tw: 全部移除

# SettingsIncompleteInstallationsHeader.Text
source: Incomplete server installations
zh_tw: 未完成的伺服器安裝

# Settings_IncompleteInstallationsDescription
source: {count} incomplete installation(s) can be removed.
zh_tw: 可移除 {count} 個未完成的安裝。

# SettingsRemoveIncompleteInstallationsButton.Content
source: Remove incomplete installations
zh_tw: 移除未完成的安裝

# Settings_IncompleteInstallationsRemoved
source: Removed {count} incomplete installation(s).
zh_tw: 已移除 {count} 個未完成的安裝。

# EngineMonitorStopButton.Content
source: Stop
zh_tw: 停止

# EngineMonitorFiltersLabel.Text
source: Filters
zh_tw: 篩選條件

# EngineMonitorStreamsHeading.Text
source: Streams
zh_tw: 訊息來源

# EngineMonitorLevelsHeading.Text
source: Levels
zh_tw: 記錄層級

source: Clear engine output
zh_tw: 清除引擎輸出

# EngineMonitorClearButtonLabel.Text
source: Clear
zh_tw: 清除

source: Copy visible engine output
zh_tw: 複製顯示中的引擎輸出

# EngineMonitorCopyButtonLabel.Text
source: Copy
zh_tw: 複製

# EngineMonitorPauseButton.Content
source: Pause
zh_tw: 暫停

# EngineMonitorSearchBox.PlaceholderText
source: Filter messages
zh_tw: 篩選訊息

source: Filter engine messages
zh_tw: 篩選引擎訊息

# EngineMonitorStdinHint.Text
source: Stdin is reserved for the parent-process watchdog; it is intentionally read-only here.
zh_tw: 標準輸入保留給父行程監看機制，因此在此僅供檢視。

# EngineMonitorEmptyText.Text
source: No engine output matches the current filters.
zh_tw: 沒有符合目前篩選條件的引擎輸出。

# EngineMonitor_Status
source: Engine PID {pid} • {visible} visible / {total} captured
zh_tw: 引擎 PID {pid} • 顯示 {visible} 筆 / 已擷取 {total} 筆

# EngineMonitor_StatusPaused
source: Paused • Engine PID {pid} • {total} captured
zh_tw: 已暫停 • 引擎 PID {pid} • 已擷取 {total} 筆

# SettingsBackendHeader.Text
source: Where servers run
zh_tw: 伺服器執行位置

# SettingsUseDocker.Header
source: Use Docker when available
zh_tw: 可用時使用 Docker

# SettingsBackendHint.Text
source: Takes effect after restarting the app. JustHostMC never installs Docker, WSL, or Hyper-V — you choose to enable this.
zh_tw: 重新啟動應用程式後生效。JustHostMC 不會安裝 Docker、WSL 或 Hyper-V；是否啟用由你決定。

# Backend_DockerAvailable
source: Docker detected (version {version}).
zh_tw: 偵測到 Docker（版本 {version}）。

# NavHome.Content
source: Home
zh_tw: 首頁

# NavAddServer.Content
source: Add server
zh_tw: 新增伺服器

# NavSettings.Content
source: Settings
zh_tw: 設定

# HomeTitle.Text
source: Home
zh_tw: 首頁

# SettingsTitle.Text
source: Settings
zh_tw: 設定

# HomeAddCard.Text
source: Add a server
zh_tw: 新增伺服器

# ServerSectionConsole.Text
source: Console
zh_tw: 控制台

# ServerSectionPlayers.Text
source: Players
zh_tw: 玩家

# ServerSectionPerformance.Text
source: Performance
zh_tw: 效能

# ServerSectionMods.Text
source: Plugins / Mods
zh_tw: 插件 / 模組

# ServerSectionConfig.Text
source: Configuration
zh_tw: 設定

# ServerEditMenuItem.Text
source: Edit server
zh_tw: 編輯伺服器

# ServerBackupsMenuItem.Text
source: Backups
zh_tw: 備份

# ServerDeleteMenuItem.Text
source: Delete server
zh_tw: 刪除伺服器

# ServerMoreButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: More options
zh_tw: 更多選項

# ServerMetaTypeLabel.Text
source: Type
zh_tw: 類型

# ServerMetaVersionLabel.Text
source: Version
zh_tw: 版本

# ServerMetaPortLabel.Text
source: Port
zh_tw: 連接埠

# ServerMetaMemoryLabel.Text
source: Memory
zh_tw: 記憶體

# ServerMetaNameLabel.Text
source: Name
zh_tw: 名稱

# ServerMetaCustomJavaArgsLabel.Text
source: Custom Java arguments
zh_tw: 自訂 Java 參數

# Server_PortLabel
source: Port {port}
zh_tw: 連接埠 {port}

# Server_PortAutoValue
source: Auto
zh_tw: 自動

# ServerState_Start
source: Start
zh_tw: 啟動

# ServerState_Stop
source: Stop
zh_tw: 停止

# ServerState_Starting
source: Starting
zh_tw: 啟動中

# ServerState_Stopping
source: Stopping
zh_tw: 停止中

# ServerState_Installing
source: Installing
zh_tw: 安裝中

# Tray_Restore
source: Open JustHostMC
zh_tw: 開啟 JustHostMC

# Tray_Exit
source: Exit
zh_tw: 結束

# Players_Header
source: Players ({count})
zh_tw: 玩家（{count}）

# ManageBansButtonLabel.Text
source: Manage bans
zh_tw: 管理封鎖

# ManageBansButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Manage bans
zh_tw: 管理封鎖名單

# ConfigPropertiesSection.Description
source: Available properties and editors are filtered for this server's Minecraft version.
zh_tw: 可用屬性與編輯器會依此伺服器的 Minecraft 版本篩選。

# ConfigSavePropertiesButton.Content
source: Save properties
zh_tw: 儲存屬性

# ConfigGameRulesSection.Title
source: Gamerules
zh_tw: 遊戲規則

# ConfigGameRulesSection.Description
source: Control world behavior, spawning, damage, inventory, and other gameplay rules.
zh_tw: 控制世界行為、生物生成、傷害、物品欄及其他遊戲規則。

# ConfigModifiedText.Text
source: Configuration modified.
zh_tw: 設定已修改。

# ConfigDiscardButtonLabel.Text
source: Discard
zh_tw: 放棄

# ConfigSaveModifiedButtonLabel.Text
source: Save changes
zh_tw: 儲存變更

# ConfigSaveGameRulesButton.Content
source: Save gamerules
zh_tw: 儲存遊戲規則

# ConfigTypeBooleanText.Text
source: Boolean
zh_tw: 布林值

# ConfigTypeIntegerText.Text
source: Integer
zh_tw: 整數

# ConfigTypeChoiceText.Text
source: Choice
zh_tw: 選項

# ConfigTypeTextText.Text
source: Text
zh_tw: 文字

# ConfigName_server_port
source: Server port
zh_tw: 伺服器連接埠

# ConfigName_query_port
source: Query port
zh_tw: 查詢連接埠

# ConfigName_motd
source: Message of the day
zh_tw: 伺服器訊息

# ConfigName_difficulty
source: Difficulty
zh_tw: 難度

# ConfigName_gamemode
source: Game mode
zh_tw: 遊戲模式

# ConfigName_max_players
source: Maximum players
zh_tw: 玩家人數上限

# ConfigName_pvp
source: Player versus player
zh_tw: 玩家對戰

# ConfigName_online_mode
source: Online mode
zh_tw: 正版驗證

# ConfigName_white_list
source: Whitelist
zh_tw: 白名單

# ConfigName_view_distance
source: View distance
zh_tw: 可視距離

# ConfigName_simulation_distance
source: Simulation distance
zh_tw: 模擬距離

# ConfigName_spawn_protection
source: Spawn protection
zh_tw: 重生點保護

# ConfigName_allow_flight
source: Allow flight
zh_tw: 允許飛行

# ConfigName_allow_nether
source: Allow Nether
zh_tw: 允許地獄

# ConfigName_enable_command_block
source: Enable command blocks
zh_tw: 啟用指令方塊

# ConfigName_enable_rcon
source: Enable RCON
zh_tw: 啟用 RCON

# ConfigName_enforce_whitelist
source: Enforce whitelist
zh_tw: 強制白名單

# ConfigName_resource_pack
source: Resource pack URL
zh_tw: 資源包網址

# ConfigName_level_name
source: World folder
zh_tw: 世界資料夾

# ConfigName_level_seed
source: World seed
zh_tw: 世界種子

# ConfigName_keepInventory
source: Keep inventory
zh_tw: 保留物品欄

# ConfigName_mobGriefing
source: Mob griefing
zh_tw: 生物破壞

# ConfigName_doDaylightCycle
source: Daylight cycle
zh_tw: 日夜循環

# ConfigName_doWeatherCycle
source: Weather cycle
zh_tw: 天氣循環

# ConfigName_doMobSpawning
source: Mob spawning
zh_tw: 生物生成

# ConfigName_doMobLoot
source: Mob loot
zh_tw: 生物掉落物

# ConfigName_doFireTick
source: Fire spread
zh_tw: 火焰蔓延

# ConfigName_randomTickSpeed
source: Random tick speed
zh_tw: 隨機刻速度

# ConfigName_spawnRadius
source: Spawn radius
zh_tw: 重生半徑

# ConfigName_showDeathMessages
source: Show death messages
zh_tw: 顯示死亡訊息

# ConfigName_playersSleepingPercentage
source: Players sleeping percentage
zh_tw: 睡覺玩家百分比

# ConfigName_doImmediateRespawn
source: Immediate respawn
zh_tw: 立即重生

# BanListStoppedNotice.Title
source: Stop server to edit
zh_tw: 停止伺服器後再編輯

# BanListStoppedNotice.Message
source: The ban files are safest to change while the server is stopped. Console ban commands still work while running.
zh_tw: 封鎖名單檔案最適合在伺服器停止時修改；伺服器執行中仍可使用主控台封鎖指令。

# BanListAddHeader.Text
source: Add ban
zh_tw: 新增封鎖

# BanListAddHint.Text
source: Add a player name, UUID, or IP address to the vanilla ban-list files.
zh_tw: 將玩家名稱、UUID 或 IP 位址加入原版封鎖名單檔案。

# BanListTypeBox.Header
source: Type
zh_tw: 類型

# BanListTypePlayerItem.Content
source: Player
zh_tw: 玩家

# BanListTypeIpItem.Content
source: IP address
zh_tw: IP 位址

# BanListTargetBox.Header
source: Target
zh_tw: 目標

# BanListTargetBox.PlaceholderText
source: Player name, UUID, or IP
zh_tw: 玩家名稱、UUID 或 IP

# BanListReasonBox.Header
source: Reason
zh_tw: 原因

# BanListReasonBox.PlaceholderText
source: Optional
zh_tw: 選填

# BanListAddButtonLabel.Text
source: Add
zh_tw: 新增

# BanListEmptyHint.Text
source: No bans yet.
zh_tw: 目前沒有封鎖項目。

source: Remove ban
zh_tw: 移除封鎖

# BanListEntryPlayerTypeText.Text
source: Player
zh_tw: 玩家

# BanListEntryNoReasonText.Text
source: No reason provided
zh_tw: 未提供原因

# PlayerRawDataBox.Header
source: Raw player NBT
zh_tw: 原始玩家 NBT

# PlayerInventoryEquipmentHeader.Text
source: Equipment
zh_tw: 裝備

# PlayerInventoryMainHeader.Text
source: Inventory
zh_tw: 物品欄

# PlayerInventoryHotbarHeader.Text
source: Hotbar
zh_tw: 快捷列

# PlayerInventoryEnderHeader.Text
source: Ender Chest
zh_tw: 終界箱

# MetricsMemory.Text
source: Memory
zh_tw: 記憶體

# MetricsNetwork.Text
source: Network
zh_tw: 網路

# MetricsNetworkUnavailable.Text
source: Per-process network usage isn't available on the on-machine backend. Run servers in Docker to see network metrics.
zh_tw: 在本機執行後端無法取得個別行程的網路使用量。使用 Docker 執行伺服器即可查看網路指標。

# ModsUploadButton.Content
source: Upload
zh_tw: 上傳

# ModsRemoveButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Remove
zh_tw: 移除

# ModsRemoveConfirmText.Text
source: Remove this file?
zh_tw: 要移除此檔案嗎？

# ModsRemoveConfirmButton.Content
source: Remove
zh_tw: 移除

# ModsUnsupportedHint.Text
source: This server type has no plugins or mods folder.
zh_tw: 此伺服器類型沒有插件或模組資料夾。

# Mods_StoppedRequired
source: Stop the server before changing plugins or mods.
zh_tw: 變更插件或模組前，請先停止伺服器。

# Mods_OperationFailed
source: The operation failed. Please try again.
zh_tw: 作業失敗。請再試一次。

# Mods_TypeMismatch
source: Built for {loader}; this mod/plugin does not match the server type.
zh_tw: 此項目適用於 {loader}，與伺服器類型不符。

# Mods_VersionMismatch
source: Requires Minecraft {version}; this mod/plugin does not match the server version.
zh_tw: 此項目需要 Minecraft {version}，與伺服器版本不符。

# Mods_TypeAndVersionMismatch
source: Built for {loader} and Minecraft {version}; neither matches this server.
zh_tw: 此項目適用於 {loader} 與 Minecraft {version}，類型及版本皆與伺服器不符。

# Mods_ParseFailed
source: Could not read this JAR's metadata.
zh_tw: 無法讀取此 JAR 的中繼資料。

# ServerOpenInstanceFolderMenuItem.Text
source: Open instance folder
zh_tw: 開啟執行個體資料夾

# ServerUpdateModpackMenuItem.Text
source: Update modpack…
zh_tw: 更新模組包…

# ServerExportModpackMenuItem.Text
source: Export modpack…
zh_tw: 匯出模組包…

# Server_UpdateModpackBody
source: Pick a version for "{0}" (currently {1}). The world and your own files are kept; pack files are replaced.
zh_tw: 為「{0}」選擇版本（目前為 {1}）。世界與你自己的檔案會保留，模組包檔案將被更換。

# Server_ExportModpackPickerName
source: CurseForge modpack
zh_tw: CurseForge 模組包

# shop.export.preparing
source: Preparing modpack export…
zh_tw: 正在準備匯出模組包…

# shop.export.zipping
source: Packaging modpack…
zh_tw: 正在打包模組包…

# shop.export.done
source: Modpack exported.
zh_tw: 模組包已匯出。

# PlayerDeopButton.Label
source: De-op
zh_tw: 取消 OP

# PlayerKickButton.Label
source: Kick
zh_tw: 踢出

# PlayerBanButton.Label
source: Ban
zh_tw: 封鎖

# PlayerRawButton.Label
source: Raw
zh_tw: 原始

# PlayerInventoryButton.Label
source: Inventory
zh_tw: 物品欄

source: Player actions
zh_tw: 玩家動作

# PlayerActionsButtonLabel.Text
source: Actions
zh_tw: 動作

# PlayerOpMenuItem.Text
source: Make operator
zh_tw: 設為 OP

# PlayerDeopMenuItem.Text
source: Remove operator
zh_tw: 移除 OP

# PlayerKickMenuItem.Text
source: Kick player
zh_tw: 踢出玩家

# PlayerBanMenuItem.Text
source: Ban player
zh_tw: 封鎖玩家

# PlayerRawMenuItem.Text
source: Show raw data
zh_tw: 顯示原始資料

# PlayerInventoryMenuItem.Text
source: Show inventory
zh_tw: 顯示物品欄

# BackupOpenFolderButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Open backup folder
zh_tw: 開啟備份資料夾

# BackupExportButton.Content
source: Export
zh_tw: 匯出

# CreateServerCustomJavaArgs.Header
source: Custom Java arguments (optional)
zh_tw: 自訂 Java 參數（選填）

# CreateServerCustomJavaArgs.PlaceholderText
source: Example: -Dexample=true -XX:MaxGCPauseMillis=150
zh_tw: 範例：-Dexample=true -XX:MaxGCPauseMillis=150

# BackupCreateButtonLabel.Text
source: Create backup
zh_tw: 建立備份

# BackupSafeOnlineLabel.Text
source: Safe online (pause saves)
zh_tw: 線上安全備份（暫停儲存）

source: Backup actions
zh_tw: 備份動作

# BackupActionsButtonLabel.Text
source: Actions
zh_tw: 動作

# BackupExportAction.Text
source: Export
zh_tw: 匯出

# BackupRestoreAction.Text
source: Restore
zh_tw: 還原

# BackupDeleteAction.Text
source: Delete
zh_tw: 刪除

# EditServerName.Header
source: Name
zh_tw: 名稱

# EditServerType.Header
source: Type
zh_tw: 類型

# EditServerVersion.Header
source: Version
zh_tw: 版本

# EditServerPort.Header
source: Port
zh_tw: 連接埠

# EditServerStoppedNotice.Title
source: Stop the server to change launch settings
zh_tw: 停止伺服器才能變更啟動設定

# EditServerStoppedNotice.Message
source: Name changes can be saved while running. Stop the server to change version, memory, custom Java arguments, or port.
zh_tw: 伺服器執行時仍可儲存名稱變更。若要變更版本、記憶體、自訂 Java 參數或連接埠，請先停止伺服器。

# ServerTeachingTip_InstalledTitle
source: {server} installed successfully
zh_tw: {server} 已成功安裝

# ServerTeachingTip_StartedTitle
source: {server} started
zh_tw: {server} 已啟動

# ServerTeachingTip_StoppedTitle
source: {server} stopped
zh_tw: {server} 已停止

# ServerTeachingTip_CrashedTitle
source: {server} crashed
zh_tw: {server} 已當機

# install.ready_to_run
source: Ready to run.
zh_tw: 已準備就緒。

# NavScripts.Content
source: Scripts
zh_tw: 腳本

# ScriptsPageTitle.Text
source: Scripts
zh_tw: 腳本

# ScriptsPageSubtitle.Text
source: Import your own Lua provider and automation scripts, review the permissions they request, and manage what is installed.
zh_tw: 匯入您自己的 Lua 提供者與自動化腳本，檢視它們要求的權限，並管理已安裝的項目。

# ScriptsProvidersHeader.Text
source: Providers
zh_tw: 提供者

# ScriptsParsersHeader.Text
source: Mod Metadata Parsers
zh_tw: 模組資訊解析器

# ScriptsParsersEmpty.Text
source: No parsers installed. Parsers read a mod or plugin jar's embedded metadata (name, version, authors, icon) for the server Mods panel.
zh_tw: 尚未安裝任何解析器。解析器會讀取模組或外掛 jar 內嵌的資訊（名稱、版本、作者、圖示），顯示在伺服器的模組面板。

# ScriptsShopsHeader.Text
source: Mod Shops
zh_tw: 模組商店

# ScriptsShopsEmpty.Text
source: No shop sources installed. Shop sources let you browse and download mods or plugins from a remote catalog such as Modrinth or CurseForge.
zh_tw: 尚未安裝任何商店來源。商店來源讓您從 Modrinth 或 CurseForge 等遠端目錄瀏覽並下載模組或外掛。

# Scripts_ShopNeedsKey
source: Requires an API key — set it in Settings.
zh_tw: 需要 API 金鑰 — 請在設定中設定。

source: Configure
zh_tw: 設定

# ScriptConfig_Save
source: Save
zh_tw: 儲存

# ScriptConfig_Cancel
source: Cancel
zh_tw: 取消

# ScriptConfig_SecretSetPlaceholder
source: Leave blank to keep the current value
zh_tw: 留空以保留目前的值

# ScriptConfig_SecretUnsetPlaceholder
source: Not set
zh_tw: 未設定

# Parsers_Formats
source: Reads: {formats}
zh_tw: 讀取：{formats}

# ModsWebsiteLink.Content
source: Website
zh_tw: 網站

source: Show scripts in folder
zh_tw: 在資料夾中顯示腳本

# ScriptSectionShowInFolderButtonLabel.Text
source: Show in Folder
zh_tw: 在資料夾中顯示

source: Add scripts
zh_tw: 新增腳本

# ScriptSectionAddScriptsButtonLabel.Text
source: Add Scripts
zh_tw: 新增腳本

# ScriptsProvidersEmpty.Text
source: No providers installed yet.
zh_tw: 尚未安裝任何提供者。

# ScriptsAutomationHeader.Text
source: Automation scripts
zh_tw: 自動化腳本

# ScriptsAutomationEmpty.Text
source: No automation scripts installed yet.
zh_tw: 尚未安裝任何自動化腳本。

source: Built in
zh_tw: 內建

# ScriptsBuiltinBadgeLabel.Text
source: Built in
zh_tw: 內建

source: Enable or disable this script
zh_tw: 啟用或停用此腳本

source: Remove
zh_tw: 移除

source: Open all automation logs in a new window
zh_tw: 在新視窗中開啟所有自動化日誌

# ScriptsAllLogsButtonLabel.Text
source: All Logs
zh_tw: 所有日誌

# ScriptsScriptLogsHeader.Text
source: Logs
zh_tw: 日誌

# ScriptsScriptLogsEmpty.Text
source: No output from this script yet.
zh_tw: 此腳本尚無輸出。

# ScriptLogsTitleBar.Title
source: All Automation Logs
zh_tw: 所有自動化日誌

# ScriptLogsWindowEmpty.Text
source: No automation output yet.
zh_tw: 尚無自動化輸出。

# ScriptLogsWindowNoSelection.Text
source: Select a log entry to view its details.
zh_tw: 選取日誌項目以檢視詳細資料。

# ScriptLogsWindowScriptDetailsHeader.Text
source: Script
zh_tw: 腳本

# ScriptLogsWindowScriptNameLabel.Text
source: Name
zh_tw: 名稱

# ScriptLogsWindowScriptIdLabel.Text
source: ID
zh_tw: 識別碼

# ScriptLogsWindowDetailHeader.Text
source: Log detail
zh_tw: 日誌詳細資料

# PermissionConsentIntro.Text
source: This script requests the following permissions. Allow only what you trust it to do.
zh_tw: 此腳本要求以下權限。請僅允許您信任的項目。

# PermissionConsentNone.Text
source: This script does not request any permissions.
zh_tw: 此腳本未要求任何權限。

# PermissionLabelNetwork.Text
source: Network access
zh_tw: 網路存取

# PermissionLabelInstall.Text
source: Install files
zh_tw: 安裝檔案

# PermissionLabelFsServer.Text
source: Access the server folder
zh_tw: 存取伺服器資料夾

# PermissionLabelConsoleRead.Text
source: Read the server console
zh_tw: 讀取伺服器主控台
